NextFOAM-2509/tutorials/lagrangian/reactingParcelFoam/splashPanel/constant/foam.inp
species
(
    O2
    H2O
    N2
)
;

reactions
{}
